FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/utilities/fsl_str.c
/*
 * Copyright 2017, 2020 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */
#include <math.h>
#include <stdarg.h>
#include <stdlib.h>
#include <errno.h> /* MISRA C-2012 Rule 22.9 */
#include "fsl_str.h"
#include "fsl_debug_console_conf.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief The overflow value.*/
#ifndef HUGE_VAL
    #define HUGE_VAL    ( 99.e99 )
#endif /* HUGE_VAL */

#ifndef MAX_FIELD_WIDTH
    #define MAX_FIELD_WIDTH    99U
#endif

#if PRINTF_ADVANCED_ENABLE
/*! @brief Specification modifier flags for printf. */
    enum _debugconsole_printf_flag
    {
        kPRINTF_Minus = 0x01U,              /*!< Minus FLag. */
        kPRINTF_Plus = 0x02U,               /*!< Plus Flag. */
        kPRINTF_Space = 0x04U,              /*!< Space Flag. */
        kPRINTF_Zero = 0x08U,               /*!< Zero Flag. */
        kPRINTF_Pound = 0x10U,              /*!< Pound Flag. */
        kPRINTF_LengthChar = 0x20U,         /*!< Length: Char Flag. */
        kPRINTF_LengthShortInt = 0x40U,     /*!< Length: Short Int Flag. */
        kPRINTF_LengthLongInt = 0x80U,      /*!< Length: Long Int Flag. */
        kPRINTF_LengthLongLongInt = 0x100U, /*!< Length: Long Long Int Flag. */
    };
#endif /* PRINTF_ADVANCED_ENABLE */

/*! @brief Specification modifier flags for scanf. */
enum _debugconsole_scanf_flag
{
    kSCANF_Suppress = 0x2U,                /*!< Suppress Flag. */
    kSCANF_DestMask = 0x7cU,               /*!< Destination Mask. */
    kSCANF_DestChar = 0x4U,                /*!< Destination Char Flag. */
    kSCANF_DestString = 0x8U,              /*!< Destination String FLag. */
    kSCANF_DestSet = 0x10U,                /*!< Destination Set Flag. */
    kSCANF_DestInt = 0x20U,                /*!< Destination Int Flag. */
    kSCANF_DestFloat = 0x30U,              /*!< Destination Float Flag. */
    kSCANF_LengthMask = 0x1f00U,           /*!< Length Mask Flag. */
    #if SCANF_ADVANCED_ENABLE
        kSCANF_LengthChar = 0x100U,        /*!< Length Char Flag. */
        kSCANF_LengthShortInt = 0x200U,    /*!< Length ShortInt Flag. */
        kSCANF_LengthLongInt = 0x400U,     /*!< Length LongInt Flag. */
        kSCANF_LengthLongLongInt = 0x800U, /*!< Length LongLongInt Flag. */
    #endif /* SCANF_ADVANCED_ENABLE */
    #if SCANF_FLOAT_ENABLE
        kSCANF_LengthLongLongDouble = 0x1000U, /*!< Length LongLongDuoble Flag. */
    #endif /*PRINTF_FLOAT_ENABLE */
    kSCANF_TypeSinged = 0x2000U,               /*!< TypeSinged Flag. */
};

/*! @brief Keil: suppress ellipsis warning in va_arg usage below. */
#if defined( __CC_ARM )
    #pragma diag_suppress 1256
#endif /* __CC_ARM */

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief Scanline function which ignores white spaces.
 *
 * @param[in]   s The address of the string pointer to update.
 * @return      String without white spaces.
 */
static uint32_t ScanIgnoreWhiteSpace( const char ** s );

/*!
 * @brief Converts a radix number to a string and return its length.
 *
 * @param[in] numstr    Converted string of the number.
 * @param[in] nump      Pointer to the number.
 * @param[in] neg       Polarity of the number.
 * @param[in] radix     The radix to be converted to.
 * @param[in] use_caps  Used to identify %x/X output format.
 *
 * @return Length of the converted string.
 */
static int32_t ConvertRadixNumToString( char * numstr,
                                        void * nump,
                                        int32_t neg,
                                        int32_t radix,
                                        bool use_caps );

#if PRINTF_FLOAT_ENABLE

/*!
 * @brief Converts a floating radix number to a string and return its length.
 *
 * @param[in] numstr            Converted string of the number.
 * @param[in] nump              Pointer to the number.
 * @param[in] radix             The radix to be converted to.
 * @param[in] precision_width   Specify the precision width.
 *
 * @return Length of the converted string.
 */
    static int32_t ConvertFloatRadixNumToString( char * numstr,
                                                 void * nump,
                                                 int32_t radix,
                                                 uint32_t precision_width );

#endif /* PRINTF_FLOAT_ENABLE */

/*************Code for process formatted data*******************************/
#if PRINTF_ADVANCED_ENABLE
    static uint8_t PrintGetSignChar( int64_t ival,
                                     uint32_t flags_used,
                                     char * schar )
    {
        uint8_t len = 1U;

        if( ival < 0 )
        {
            *schar = '-';
        }
        else
        {
            if( 0U != ( flags_used & ( uint32_t ) kPRINTF_Plus ) )
            {
                *schar = '+';
            }
            else if( 0U != ( flags_used & ( uint32_t ) kPRINTF_Space ) )
            {
                *schar = ' ';
            }
            else
            {
                *schar = '\0';
                len = 0U;
            }
        }

        return len;
    }
#endif /* if PRINTF_ADVANCED_ENABLE */

static uint32_t PrintGetWidth( const char ** p,
                               va_list * ap )
{
    uint32_t field_width = 0;
    uint8_t done = 0U;
    char c;

    while( 0U == done )
    {
        c = *( ++( *p ) );

        if( ( c >= '0' ) && ( c <= '9' ) )
        {
            ( field_width ) = ( ( field_width ) * 10U ) + ( ( uint32_t ) c - ( uint32_t ) '0' );
        }

        #if PRINTF_ADVANCED_ENABLE
            else if( c == '*' )
            {
                ( field_width ) = ( uint32_t ) va_arg( *ap, uint32_t );
            }
        #endif /* PRINTF_ADVANCED_ENABLE */
        else
        {
            /* We've gone one char too far. */
            --( *p );
            done = 1U;
        }
    }

    return field_width;
}

static uint32_t PrintGetPrecision( const char ** s,
                                   va_list * ap,
                                   bool * valid_precision_width )
{
    const char * p = *s;
    uint32_t precision_width = 6U;
    uint8_t done = 0U;

    #if PRINTF_ADVANCED_ENABLE
        if( NULL != valid_precision_width )
        {
            *valid_precision_width = false;
        }
    #endif /* PRINTF_ADVANCED_ENABLE */

    if( *++p == '.' )
    {
        /* Must get precision field width, if present. */
        precision_width = 0U;
        done = 0U;

        while( 0U == done )
        {
            char c = *++p;

            if( ( c >= '0' ) && ( c <= '9' ) )
            {
                precision_width = ( precision_width * 10U ) + ( ( uint32_t ) c - ( uint32_t ) '0' );
                #if PRINTF_ADVANCED_ENABLE
                    if( NULL != valid_precision_width )
                    {
                        *valid_precision_width = true;
                    }
                #endif /* PRINTF_ADVANCED_ENABLE */
            }

            #if PRINTF_ADVANCED_ENABLE
                else if( c == '*' )
                {
                    precision_width = ( uint32_t ) va_arg( *ap, uint32_t );

                    if( NULL != valid_precision_width )
                    {
                        *valid_precision_width = true;
                    }
                }
            #endif /* PRINTF_ADVANCED_ENABLE */
            else
            {
                /* We've gone one char too far. */
                --p;
                done = 1U;
            }
        }
    }
    else
    {
        /* We've gone one char too far. */
        --p;
    }

    *s = p;
    return precision_width;
}

static uint32_t PrintIsobpu( const char c )
{
    uint32_t ret = 0U;

    if( ( c == 'o' ) || ( c == 'b' ) || ( c == 'p' ) || ( c == 'u' ) )
    {
        ret = 1U;
    }

    return ret;
}

static uint32_t PrintIsdi( const char c )
{
    uint32_t ret = 0U;

    if( ( c == 'd' ) || ( c == 'i' ) )
    {
        ret = 1U;
    }

    return ret;
}

