FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/utilities/fsl_str.c
static void PrintOutputdifFobpu( uint32_t flags_used,
                                 uint32_t field_width,
                                 uint32_t vlen,
                                 char schar,
                                 char * vstrp,
                                 printfCb cb,
                                 char * buf,
                                 int32_t * count )
{
    #if PRINTF_ADVANCED_ENABLE
        /* Do the ZERO pad. */
        if( 0U != ( flags_used & ( uint32_t ) kPRINTF_Zero ) )
        {
            if( '\0' != schar )
            {
                cb( buf, count, schar, 1 );
                schar = '\0';
            }

            cb( buf, count, '0', ( int ) field_width - ( int ) vlen );
            vlen = field_width;
        }
        else
        {
            if( 0U == ( flags_used & ( uint32_t ) kPRINTF_Minus ) )
            {
                cb( buf, count, ' ', ( int ) field_width - ( int ) vlen );

                if( '\0' != schar )
                {
                    cb( buf, count, schar, 1 );
                    schar = '\0';
                }
            }
        }

        /* The string was built in reverse order, now display in correct order. */
        if( '\0' != schar )
        {
            cb( buf, count, schar, 1 );
        }
    #else  /* if PRINTF_ADVANCED_ENABLE */
        cb( buf, count, ' ', ( int ) field_width - ( int ) vlen );
    #endif /* PRINTF_ADVANCED_ENABLE */

    while( '\0' != ( *vstrp ) )
    {
        cb( buf, count, *vstrp--, 1 );
    }

    #if PRINTF_ADVANCED_ENABLE
        if( 0U != ( flags_used & ( uint32_t ) kPRINTF_Minus ) )
        {
            cb( buf, count, ' ', ( int ) field_width - ( int ) vlen );
        }
    #endif /* PRINTF_ADVANCED_ENABLE */
}

static void PrintOutputxX( uint32_t flags_used,
                           uint32_t field_width,
                           uint32_t vlen,
                           bool use_caps,
                           char * vstrp,
                           printfCb cb,
                           char * buf,
                           int32_t * count )
{
    #if PRINTF_ADVANCED_ENABLE
        uint8_t dschar = 0;

        if( 0U != ( flags_used & ( uint32_t ) kPRINTF_Zero ) )
        {
            if( 0U != ( flags_used & ( uint32_t ) kPRINTF_Pound ) )
            {
                cb( buf, count, '0', 1 );
                cb( buf, count, ( use_caps ? 'X' : 'x' ), 1 );
                dschar = 1U;
            }

            cb( buf, count, '0', ( int ) field_width - ( int ) vlen );
            vlen = field_width;
        }
        else
        {
            if( 0U == ( flags_used & ( uint32_t ) kPRINTF_Minus ) )
            {
                if( 0U != ( flags_used & ( uint32_t ) kPRINTF_Pound ) )
                {
                    vlen += 2U;
                }

                cb( buf, count, ' ', ( int ) field_width - ( int ) vlen );

                if( 0U != ( flags_used & ( uint32_t ) kPRINTF_Pound ) )
                {
                    cb( buf, count, '0', 1 );
                    cb( buf, count, ( use_caps ? 'X' : 'x' ), 1 );
                    dschar = 1U;
                }
            }
        }

        if( ( 0U != ( flags_used & ( uint32_t ) kPRINTF_Pound ) ) && ( 0U == dschar ) )
        {
            cb( buf, count, '0', 1 );
            cb( buf, count, ( use_caps ? 'X' : 'x' ), 1 );
            vlen += 2U;
        }
    #else  /* if PRINTF_ADVANCED_ENABLE */
        cb( buf, count, ' ', ( int ) field_width - ( int ) vlen );
    #endif /* PRINTF_ADVANCED_ENABLE */

    while( '\0' != ( *vstrp ) )
    {
        cb( buf, count, *vstrp--, 1 );
    }

    #if PRINTF_ADVANCED_ENABLE
        if( 0U != ( flags_used & ( uint32_t ) kPRINTF_Minus ) )
        {
            cb( buf, count, ' ', ( int ) field_width - ( int ) vlen );
        }
    #endif /* PRINTF_ADVANCED_ENABLE */
}

static uint32_t PrintIsfF( const char c )
{
    uint32_t ret = 0U;

    if( ( c == 'f' ) || ( c == 'F' ) )
    {
        ret = 1U;
    }

    return ret;
}

static uint32_t PrintIsxX( const char c )
{
    uint32_t ret = 0U;

    if( ( c == 'x' ) || ( c == 'X' ) )
    {
        ret = 1U;
    }

    return ret;
}

#if PRINTF_ADVANCED_ENABLE
    static uint32_t PrintCheckFlags( const char ** s )
    {
        const char * p = *s;
        /* First check for specification modifier flags. */
        uint32_t flags_used = 0U;
        bool done = false;

        while( false == done )
        {
            switch( *++p )
            {
                case '-':
                    flags_used |= ( uint32_t ) kPRINTF_Minus;
                    break;

                case '+':
                    flags_used |= ( uint32_t ) kPRINTF_Plus;
                    break;

                case ' ':
                    flags_used |= ( uint32_t ) kPRINTF_Space;
                    break;

                case '0':
                    flags_used |= ( uint32_t ) kPRINTF_Zero;
                    break;

                case '#':
                    flags_used |= ( uint32_t ) kPRINTF_Pound;
                    break;

                default:
                    /* We've gone one char too far. */
                    --p;
                    done = true;
                    break;
            }
        }

        *s = p;
        return flags_used;
    }
#endif /* PRINTF_ADVANCED_ENABLE */

#if PRINTF_ADVANCED_ENABLE

/*
 * Check for the length modifier.
 */
    static uint32_t PrintGetLengthFlag( const char ** s )
    {
        const char * p = *s;
        /* First check for specification modifier flags. */
        uint32_t flags_used = 0U;

        switch( /* c = */ *++p )
        {
            case 'h':

                if( *++p != 'h' )
                {
                    flags_used |= ( uint32_t ) kPRINTF_LengthShortInt;
                    --p;
                }
                else
                {
                    flags_used |= ( uint32_t ) kPRINTF_LengthChar;
                }

                break;

            case 'l':

                if( *++p != 'l' )
                {
                    flags_used |= ( uint32_t ) kPRINTF_LengthLongInt;
                    --p;
                }
                else
                {
                    flags_used |= ( uint32_t ) kPRINTF_LengthLongLongInt;
                }

                break;

            default:
                /* we've gone one char too far */
                --p;
                break;
        }

        *s = p;
        return flags_used;
    }
#else  /* if PRINTF_ADVANCED_ENABLE */
    static void PrintFilterLengthFlag( const char ** s )
    {
        const char * p = *s;
        char ch;

        do
        {
            ch = *++p;
        } while( ( ch == 'h' ) || ( ch == 'l' ) );

        *s = --p;
    }
#endif /* PRINTF_ADVANCED_ENABLE */

static uint8_t PrintGetRadixFromobpu( const char c )
{
    uint8_t radix;

    if( c == 'o' )
    {
        radix = 8U;
    }
    else if( c == 'b' )
    {
        radix = 2U;
    }
    else if( c == 'p' )
    {
        radix = 16U;
    }
    else
    {
        radix = 10U;
    }

