FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/utilities/fsl_str.c
    return radix;
}

static uint32_t ScanIsWhiteSpace( const char c )
{
    uint32_t ret = 0U;

    if( ( c == ' ' ) || ( c == '\t' ) || ( c == '\n' ) || ( c == '\r' ) || ( c == '\v' ) || ( c == '\f' ) )
    {
        ret = 1U;
    }

    return ret;
}

static uint32_t ScanIgnoreWhiteSpace( const char ** s )
{
    uint32_t count = 0U;
    char c;

    c = **s;

    while( 1U == ScanIsWhiteSpace( c ) )
    {
        count++;
        ( *s )++;
        c = **s;
    }

    return count;
}

static int32_t ConvertRadixNumToString( char * numstr,
                                        void * nump,
                                        int32_t neg,
                                        int32_t radix,
                                        bool use_caps )
{
    #if PRINTF_ADVANCED_ENABLE
        int64_t a;
        int64_t b;
        int64_t c;

        uint64_t ua;
        uint64_t ub;
        uint64_t uc;
    #else
        int32_t a;
        int32_t b;
        int32_t c;

        uint32_t ua;
        uint32_t ub;
        uint32_t uc;
    #endif /* PRINTF_ADVANCED_ENABLE */

    int32_t nlen;
    char * nstrp;

    nlen = 0;
    nstrp = numstr;
    *nstrp++ = '\0';

    #if !( PRINTF_ADVANCED_ENABLE > 0 )
        neg = 0;
    #endif

    if( 0 != neg )
    {
        #if PRINTF_ADVANCED_ENABLE
            a = *( int64_t * ) nump;
        #else
            a = *( int32_t * ) nump;
        #endif /* PRINTF_ADVANCED_ENABLE */

        if( a == 0 )
        {
            *nstrp = '0';
            ++nlen;
            return nlen;
        }

        while( a != 0 )
        {
            #if PRINTF_ADVANCED_ENABLE
                b = ( int64_t ) a / ( int64_t ) radix;
                c = ( int64_t ) a - ( ( int64_t ) b * ( int64_t ) radix );

                if( c < 0 )
                {
                    c = ( int64_t ) '0' - c;
                }
            #else
                b = a / radix;
                c = a - ( b * radix );

                if( c < 0 )
                {
                    c = ( int32_t ) '0' - c;
                }
            #endif /* PRINTF_ADVANCED_ENABLE */
            else
            {
                c = c + ( int32_t ) '0';
            }
            a = b;
            *nstrp++ = ( char ) c;
            ++nlen;
        }
    }
    else
    {
        #if PRINTF_ADVANCED_ENABLE
            ua = *( uint64_t * ) nump;
        #else
            ua = *( uint32_t * ) nump;
        #endif /* PRINTF_ADVANCED_ENABLE */

        if( ua == 0U )
        {
            *nstrp = '0';
            ++nlen;
            return nlen;
        }

        while( ua != 0U )
        {
            #if PRINTF_ADVANCED_ENABLE
                ub = ( uint64_t ) ua / ( uint64_t ) radix;
                uc = ( uint64_t ) ua - ( ( uint64_t ) ub * ( uint64_t ) radix );
            #else
                ub = ua / ( uint32_t ) radix;
                uc = ua - ( ub * ( uint32_t ) radix );
            #endif /* PRINTF_ADVANCED_ENABLE */

            if( uc < 10U )
            {
                uc = uc + ( uint32_t ) '0';
            }
            else
            {
                uc = uc - 10U + ( uint32_t ) ( use_caps ? 'A' : 'a' );
            }

            ua = ub;
            *nstrp++ = ( char ) uc;
            ++nlen;
        }
    }

    return nlen;
}

#if PRINTF_FLOAT_ENABLE
    static int32_t ConvertFloatRadixNumToString( char * numstr,
                                                 void * nump,
                                                 int32_t radix,
                                                 uint32_t precision_width )
    {
        int32_t a;
        int32_t b;
        int32_t c;
        int32_t i;
        double fa;
        double dc;
        double fb;
        double r;
        double fractpart;
        double intpart;

        int32_t nlen;
        char * nstrp;

        nlen = 0;
        nstrp = numstr;
        *nstrp++ = '\0';
        r = *( double * ) nump;

        if( 0.0 == r )
        {
            *nstrp = '0';
            ++nlen;
            return nlen;
        }

        fractpart = modf( ( double ) r, ( double * ) &intpart );

        /* Process fractional part. */
        for( i = 0; i < ( int32_t ) precision_width; i++ )
        {
            fractpart *= ( double ) radix;
        }

        if( r >= ( double ) 0.0 )
        {
            fa = fractpart + ( double ) 0.5;

            if( fa >= pow( ( double ) 10, ( double ) precision_width ) )
            {
                intpart++;
            }
        }
        else
        {
            fa = fractpart - ( double ) 0.5;

            if( fa <= -pow( ( double ) 10, ( double ) precision_width ) )
            {
                intpart--;
            }
        }

        for( i = 0; i < ( int32_t ) precision_width; i++ )
        {
            fb = fa / ( double ) radix;
            dc = ( fa - ( double ) ( int64_t ) fb * ( double ) radix );
            c = ( int32_t ) dc;

            if( c < 0 )
            {
                c = ( int32_t ) '0' - c;
            }
            else
            {
                c = c + '0';
            }

            fa = fb;
            *nstrp++ = ( char ) c;
            ++nlen;
        }

        *nstrp++ = ( char ) '.';
        ++nlen;
        a = ( int32_t ) intpart;

        if( a == 0 )
        {
            *nstrp++ = '0';
            ++nlen;
        }
        else
        {
            while( a != 0 )
            {
                b = ( int32_t ) a / ( int32_t ) radix;
                c = ( int32_t ) a - ( ( int32_t ) b * ( int32_t ) radix );

                if( c < 0 )
                {
                    c = ( int32_t ) '0' - c;
                }
                else
                {
                    c = c + '0';
                }

                a = b;
                *nstrp++ = ( char ) c;
                ++nlen;
            }
        }

        return nlen;
    }
#endif /* PRINTF_FLOAT_ENABLE */

/*!
 * brief This function outputs its parameters according to a formatted string.
 *
 * note I/O is performed by calling given function pointer using following
 * (*func_ptr)(c);
 *
 * param[in] fmt_ptr   Format string for printf.
 * param[in] args_ptr  Arguments to printf.
 * param[in] buf  pointer to the buffer
 * param cb print callback function pointer
 *
 * return Number of characters to be print
 */
int StrFormatPrintf( const char * fmt,
                     va_list ap,
                     char * buf,
                     printfCb cb )
{
    /* va_list ap; */
    const char * p;
    char c;

