FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/utilities/fsl_str.c
                if( NULL != sval )
                {
                    #if PRINTF_ADVANCED_ENABLE
                        if( valid_precision_width )
                        {
                            vlen = ( int32_t ) precision_width;
                        }
                        else
                        {
                            vlen = ( int32_t ) strlen( sval );
                        }
                    #else
                        vlen = ( int32_t ) strlen( sval );
                    #endif /* PRINTF_ADVANCED_ENABLE */
                    #if PRINTF_ADVANCED_ENABLE
                        if( 0U == ( flags_used & ( uint32_t ) kPRINTF_Minus ) )
                    #endif /* PRINTF_ADVANCED_ENABLE */
                    {
                        cb( buf, &count, ' ', ( int ) field_width - ( int ) vlen );
                    }

                    #if PRINTF_ADVANCED_ENABLE
                        if( valid_precision_width )
                        {
                            while( ( '\0' != *sval ) && ( vlen > 0 ) )
                            {
                                cb( buf, &count, *sval++, 1 );
                                vlen--;
                            }

                            /* In case that vlen sval is shorter than vlen */
                            vlen = ( int32_t ) precision_width - vlen;
                        }
                        else
                        {
                    #endif /* PRINTF_ADVANCED_ENABLE */

                    while( '\0' != ( *sval ) )
                    {
                        cb( buf, &count, *sval++, 1 );
                    }

                    #if PRINTF_ADVANCED_ENABLE
                }
                    #endif /* PRINTF_ADVANCED_ENABLE */

                    #if PRINTF_ADVANCED_ENABLE
                        if( 0U != ( flags_used & ( uint32_t ) kPRINTF_Minus ) )
                        {
                            cb( buf, &count, ' ', ( int32_t ) field_width - vlen );
                        }
                    #endif /* PRINTF_ADVANCED_ENABLE */
                }
            }
            else
            {
                cb( buf, &count, c, 1 );
            }
        }
        p++;
    }

    return count;
}

#if SCANF_FLOAT_ENABLE
    static uint8_t StrFormatScanIsFloat( char * c )
    {
        uint8_t ret = 0U;

        if( ( 'a' == ( *c ) ) || ( 'A' == ( *c ) ) || ( 'e' == ( *c ) ) || ( 'E' == ( *c ) ) || ( 'f' == ( *c ) ) || ( 'F' == ( *c ) ) ||
            ( 'g' == ( *c ) ) || ( 'G' == ( *c ) ) )
        {
            ret = 1U;
        }

        return ret;
    }
#endif /* if SCANF_FLOAT_ENABLE */

static uint8_t StrFormatScanIsFormatStarting( char * c )
{
    uint8_t ret = 1U;

    if( ( *c != '%' ) )
    {
        ret = 0U;
    }
    else if( *( c + 1 ) == '%' )
    {
        ret = 0U;
    }
    else
    {
        /*MISRA rule 15.7*/
    }

    return ret;
}

static uint8_t StrFormatScanGetBase( uint8_t base,
                                     const char * s )
{
    if( base == 0U )
    {
        if( s[ 0 ] == '0' )
        {
            if( ( s[ 1 ] == 'x' ) || ( s[ 1 ] == 'X' ) )
            {
                base = 16;
            }
            else
            {
                base = 8;
            }
        }
        else
        {
            base = 10;
        }
    }

    return base;
}

static uint8_t StrFormatScanCheckSymbol( const char * p,
                                         int8_t * neg )
{
    uint8_t len;

    switch( *p )
    {
        case '-':
            *neg = -1;
            len = 1;
            break;

        case '+':
            *neg = 1;
            len = 1;
            break;

        default:
            *neg = 1;
            len = 0;
            break;
    }

    return len;
}

static uint8_t StrFormatScanFillInteger( uint32_t flag,
                                         va_list * args_ptr,
                                         int32_t val )
{
    #if SCANF_ADVANCED_ENABLE
        if( 0U != ( flag & ( uint32_t ) kSCANF_Suppress ) )
        {
            return 0u;
        }

        switch( flag & ( uint32_t ) kSCANF_LengthMask )
        {
            case ( uint32_t ) kSCANF_LengthChar:

                if( 0U != ( flag & ( uint32_t ) kSCANF_TypeSinged ) )
                {
                    *va_arg( *args_ptr, signed char * ) = ( signed char ) val;
                }
                else
                {
                    *va_arg( *args_ptr, unsigned char * ) = ( unsigned char ) val;
                }

                break;

            case ( uint32_t ) kSCANF_LengthShortInt:

                if( 0U != ( flag & ( uint32_t ) kSCANF_TypeSinged ) )
                {
                    *va_arg( *args_ptr, signed short * ) = ( signed short ) val;
                }
                else
                {
                    *va_arg( *args_ptr, unsigned short * ) = ( unsigned short ) val;
                }

                break;

            case ( uint32_t ) kSCANF_LengthLongInt:

                if( 0U != ( flag & ( uint32_t ) kSCANF_TypeSinged ) )
                {
                    *va_arg( *args_ptr, signed long int * ) = ( signed long int ) val;
                }
                else
                {
                    *va_arg( *args_ptr, unsigned long int * ) = ( unsigned long int ) val;
                }

                break;

            case ( uint32_t ) kSCANF_LengthLongLongInt:

                if( 0U != ( flag & ( uint32_t ) kSCANF_TypeSinged ) )
                {
                    *va_arg( *args_ptr, signed long long int * ) = ( signed long long int ) val;
                }
                else
                {
                    *va_arg( *args_ptr, unsigned long long int * ) = ( unsigned long long int ) val;
                }

                break;

            default:

                /* The default type is the type int. */
                if( 0U != ( flag & ( uint32_t ) kSCANF_TypeSinged ) )
                {
                    *va_arg( *args_ptr, signed int * ) = ( signed int ) val;
                }
                else
                {
                    *va_arg( *args_ptr, unsigned int * ) = ( unsigned int ) val;
                }

                break;
        }
    #else  /* if SCANF_ADVANCED_ENABLE */
        /* The default type is the type int. */
        if( 0U != ( flag & ( uint32_t ) kSCANF_TypeSinged ) )
        {
            *va_arg( *args_ptr, signed int * ) = ( signed int ) val;
        }
        else
        {
            *va_arg( *args_ptr, unsigned int * ) = ( unsigned int ) val;
        }
    #endif /* SCANF_ADVANCED_ENABLE */

    return 1u;
}

