FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/utilities/fsl_str.c
#if SCANF_FLOAT_ENABLE
    static uint8_t StrFormatScanFillFloat( uint32_t flag,
                                           va_list * args_ptr,
                                           double fnum )
    {
        #if SCANF_ADVANCED_ENABLE
            if( 0U != ( flag & ( uint32_t ) kSCANF_Suppress ) )
            {
                return 0u;
            }
            else
        #endif /* SCANF_ADVANCED_ENABLE */
        {
            if( 0U != ( flag & ( uint32_t ) kSCANF_LengthLongLongDouble ) )
            {
                *va_arg( *args_ptr, double * ) = fnum;
            }
            else
            {
                *va_arg( *args_ptr, float * ) = ( float ) fnum;
            }

            return 1u;
        }
    }
#endif /* SCANF_FLOAT_ENABLE */

static uint8_t StrFormatScanfStringHandling( char ** str,
                                             uint32_t * flag,
                                             uint32_t * field_width,
                                             uint8_t * base )
{
    uint8_t exitPending = 0U;
    char * c = *str;

    /* Loop to get full conversion specification. */
    while( ( '\0' != ( *c ) ) && ( 0U == ( *flag & ( uint32_t ) kSCANF_DestMask ) ) )
    {
        #if SCANF_ADVANCED_ENABLE
            if( '*' == ( *c ) )
            {
                if( 0U != ( ( *flag ) & ( uint32_t ) kSCANF_Suppress ) )
                {
                    /* Match failure. */
                    exitPending = 1U;
                }
                else
                {
                    ( *flag ) |= ( uint32_t ) kSCANF_Suppress;
                }
            }
            else if( 'h' == ( *c ) )
            {
                if( 0U != ( ( *flag ) & ( uint32_t ) kSCANF_LengthMask ) )
                {
                    /* Match failure. */
                    exitPending = 1U;
                }
                else
                {
                    if( c[ 1 ] == 'h' )
                    {
                        ( *flag ) |= ( uint32_t ) kSCANF_LengthChar;
                        c++;
                    }
                    else
                    {
                        ( *flag ) |= ( uint32_t ) kSCANF_LengthShortInt;
                    }
                }
            }
            else if( 'l' == ( *c ) )
            {
                if( 0U != ( ( *flag ) & ( uint32_t ) kSCANF_LengthMask ) )
                {
                    /* Match failure. */
                    exitPending = 1U;
                }
                else
                {
                    if( c[ 1 ] == 'l' )
                    {
                        ( *flag ) |= ( uint32_t ) kSCANF_LengthLongLongInt;
                        c++;
                    }
                    else
                    {
                        ( *flag ) |= ( uint32_t ) kSCANF_LengthLongInt;
                    }
                }
            }
            else
        #endif /* SCANF_ADVANCED_ENABLE */
        #if SCANF_FLOAT_ENABLE
            if( 'L' == ( *c ) )
            {
                if( 0U != ( ( *flag ) & ( uint32_t ) kSCANF_LengthMask ) )
                {
                    /* Match failure. */
                    exitPending = 1U;
                }
                else
                {
                    ( *flag ) |= ( uint32_t ) kSCANF_LengthLongLongDouble;
                }
            }
            else
        #endif /* SCANF_FLOAT_ENABLE */

        if( ( ( *c ) >= '0' ) && ( ( *c ) <= '9' ) )
        {
            {
                char * p;
                errno = 0;
                ( *field_width ) = strtoul( c, &p, 10 );

                if( 0 != errno )
                {
                    *field_width = 0U;
                }

                c = p - 1;
            }
        }
        else if( 'd' == ( *c ) )
        {
            ( *base ) = 10U;
            ( *flag ) |= ( uint32_t ) kSCANF_TypeSinged;
            ( *flag ) |= ( uint32_t ) kSCANF_DestInt;
        }
        else if( 'u' == ( *c ) )
        {
            ( *base ) = 10U;
            ( *flag ) |= ( uint32_t ) kSCANF_DestInt;
        }
        else if( 'o' == ( *c ) )
        {
            ( *base ) = 8U;
            ( *flag ) |= ( uint32_t ) kSCANF_DestInt;
        }
        else if( ( 'x' == ( *c ) ) )
        {
            ( *base ) = 16U;
            ( *flag ) |= ( uint32_t ) kSCANF_DestInt;
        }
        else if( 'X' == ( *c ) )
        {
            ( *base ) = 16U;
            ( *flag ) |= ( uint32_t ) kSCANF_DestInt;
        }
        else if( 'i' == ( *c ) )
        {
            ( *base ) = 0U;
            ( *flag ) |= ( uint32_t ) kSCANF_DestInt;
        }

        #if SCANF_FLOAT_ENABLE
            else if( 1U == StrFormatScanIsFloat( c ) )
            {
                ( *flag ) |= ( uint32_t ) kSCANF_DestFloat;
            }
        #endif /* SCANF_FLOAT_ENABLE */
        else if( 'c' == ( *c ) )
        {
            ( *flag ) |= ( uint32_t ) kSCANF_DestChar;

            if( MAX_FIELD_WIDTH == ( *field_width ) )
            {
                ( *field_width ) = 1;
            }
        }
        else if( 's' == ( *c ) )
        {
            ( *flag ) |= ( uint32_t ) kSCANF_DestString;
        }
        else
        {
            exitPending = 1U;
        }

        if( 1U == exitPending )
        {
            break;
        }
        else
        {
            c++;
        }
    }

    *str = c;
    return exitPending;
}

/*!
 * brief Converts an input line of ASCII characters based upon a provided
 * string format.
 *
 * param[in] line_ptr The input line of ASCII data.
 * param[in] format   Format first points to the format string.
 * param[in] args_ptr The list of parameters.
 *
 * return Number of input items converted and assigned.
 * retval IO_EOF When line_ptr is empty string "".
 */
int StrFormatScanf( const char * line_ptr,
                    char * format,
                    va_list args_ptr )
{
    uint8_t base;
    int8_t neg;
    /* Identifier for the format string. */
    char * c = format;
    char * buf;
    /* Flag telling the conversion specification. */
    uint32_t flag = 0;
    /* Filed width for the matching input streams. */
    uint32_t field_width;
    /* How many arguments are assigned except the suppress. */
    uint32_t nassigned = 0;
    /* How many characters are read from the input streams. */
    uint32_t n_decode = 0;

